
SELECT * FROM document;

insert into document (category_id, name, content)
select c.id, '에코위키', '[include(틀:회원수정3)]
[include(틀:한국어 위키/엔하계)]
||<-2><table align=right><table width=420><table bordercolor=#00a495,#010101><table bgcolor=#ffffff,#2d2f34> {{{#!wiki style="margin: -5px -10px; padding: 5px 10px; background-image: linear-gradient(to right, #00a495 30%, #13ad65)"
{{{#ffffff {{{+1 ''''''에코위키''''''}}}[br]namuwiki}}}}}} ||
||<-2><bgcolor=#ffffff> [[파일:에코위키:로고2.png|width=100]] [[파일:에코위키:로고1.png|width=230]] ||
||<bgcolor=#00a495,#010101> ''''''{{{#ffffff,#dddddd 사용 언어}}}'''''' ||[[한국어]] ||
||<bgcolor=#00a495,#010101> ''''''{{{#ffffff,#dddddd 사이트 종류}}}'''''' ||[[위키]] ||
||<bgcolor=#00a495,#010101> ''''''{{{#ffffff,#dddddd 위키 엔진}}}'''''' ||[[the seed]] ||
||<bgcolor=#00a495,#010101> ''''''{{{#ffffff,#dddddd 위키 문법}}}'''''' ||[[에코위키:문법 도움말|나무마크]] ||
||<bgcolor=#00a495,#010101> ''''''{{{#ffffff,#dddddd 설립일}}}'''''' ||[[2015년]] [[4월 17일]] ||
||<bgcolor=#00a495,#010101> ''''''{{{#ffffff,#dddddd 설립자}}}'''''' ||[[namu]], [[에코위키:전직 특수 운영진#s-1.1.5|PPPP]], [[kasio]] ||
||<bgcolor=#00a495,#010101> ''''''{{{#ffffff,#dddddd 소유주}}}'''''' ||[[umanle S.R.L.]] ||
||<bgcolor=#00a495,#010101> ''''''{{{#ffffff,#dddddd 라이선스}}}'''''' ||[[크리에이티브 커먼즈 라이선스#s-4.6|CC BY-NC-SA 2.0 KR]] ||
||<bgcolor=#00a495,#010101> ''''''{{{#ffffff,#dddddd 가입 필요 여부}}}'''''' ||선택 ||
||<bgcolor=#00a495,#010101> ''''''{{{#ffffff,#dddddd 전체 문서 수}}}'''''' ||[PageCount(문서)]개 ||
||<bgcolor=#00a495,#010101> ''''''{{{#ffffff,#dddddd 현재 상태}}}'''''' ||운영 중 ||
||<bgcolor=#00a495,#010101> ''''''{{{#ffffff,#dddddd 사이트 주소}}}'''''' ||[[https://namu.wiki|namu.wiki]] ||
[include(틀:에코위키 공식 마스코트)]

[목차]
[include(틀:-)]
== 개요 ==
>''''''에코위키, 여러분이 가꾸어 나가는 지식의 나무''''''
>----
>공식 [[슬로건]]
[[2015년]] [[4월 17일]]([[KST]])에 탄생한 [[한국어]] 기반 [[위키]]. 본사는 [[파라과이]]의 [[아순시온]]에 있으며, [[서버]]는 [[아마존닷컴]]의 [[아마존 웹 서비스]]를, [[도메인]]은 Namecheap 업체에서 구매하여 사용 중이다.

== [[에코위키:상징|상징]] ==
[include(틀:상세 내용, 문서명=에코위키:상징)]

== [[에코위키/역사|역사]] ==
[include(틀:상세 내용, 문서명=에코위키/역사)]

== 개설자 ==
에코위키의 개설자는 ''''''[[namu]],'''''' [[에코위키:전직 특수 운영진#s-1.1.5|PPPP]], [[kasio]]이다. 이들은 [[리그베다 위키 게시판]]에 [[유동닉]]으로 처음 등장했는데, 에코위키 개설자들은 특정 단체나 집단의 이익을 위해 행동하고 있지 않으며, 에코위키 개설자들은 지식의 사유화를 반대하며 평화로운 방식으로 지식의 자유로운 공유를 지원하는 것이 목표라고 밝혔다. 에코위키 설립 이후 [[ztirf]], [[syndrome]]이 합류하면서 초창기 운영진이 구성되었다.[* namu가 직접 이 문서를 편집하면서 [[https://namu.wiki/history/에코위키?from=3249|수정코멘트]]로 ztirf와 syndrome은 에코위키가 설립된 이후에 합류하였다고 밝혔다.] [[:파일:namuwiki_n4.jpg|2015년 5월 8일 공지사항]]에서 syndrome이 밝힌 당시 운영진들의 소임은 다음과 같다.

 * namu - 백엔드 개발자
 * PPPP - 프론트엔드 개발자
 * kasio - 렌더러 개발자
 * ztirf - 위키 관리 및 게시판 관리
 * syndrome - 이슈 트래커 및 기타 이슈 관리

에코위키 개설자들은 신상을 비공개하고 있는데, 여러 이유가 존재하지만 주된 이유는 법적 분쟁을 의식하고 있기 때문이다. 일단 개발자들의 신원이 밝혀지면 에코위키에 불만이 있는 개인 혹은 단체들이 사방에서 고소를 걸 가능성이 매우 높은데다[* [[청동(인물)|청동]]이 [[리그베다 위키]]를 운영할 때 문서 관련해서 [[고소(법률)|고소]]·[[고발]]에 상당히 자주 시달렸다.], 리그베다 위키 측에서 [[법무법인]]을 동원한 광범위한 고소를 할 가능성도 배제할 수 없기 때문에 익명을 유지하고 있다. 개설자 namu의 [[:파일:namuwiki_n5.jpg|에코위키 Q&A 게시판 답변]]에 따르면 본업이 [[정보보호|정보보안]]과 관련되어 있다고 한다.

에코위키가 소유권 이전을 거쳐 [[파라과이]] 법인 유한책임회사 [[umanle S.R.L.]]에 인수된 이후로는 에코위키 개설자들은 별도의 특별한 권한이 없다.

== [[에코위키:역대 운영진|운영자]] ==
[include(틀:상세 내용, 문서명=에코위키:역대 운영진)]

== [[:분류:에코위키의 기능|기능]] ==
[include(틀:상세 내용, 문서명=분류:에코위키의 기능)]
에코위키는 자체 [[위키 엔진]]인 [[the seed]]과 자체적인 텍스트 문법인 [[나무마크]][* [[리그베다 위키]]에서 사용하는 [[모니위키]] 문법과 100% 호환이 되지 않는다. 때문에 리그베다 위키에서 [[포크]]한 문서들의 초기 판본을 보면 [[하이퍼링크]]나 이미지 파일이 깨져있는 경우가 많다. 이로 인해 설립 초창기에 [[namubot]]이라는 [[봇#s-2]]을 돌려 호환되지 않는 모니위키 문법을 수정했다.]를 사용한다. [[HTTP/2]]를 지원하며, 아래에 있는 주요 기능 목록의 하이퍼링크를 누르면 각 기능을 설명하는 문서로 연결된다.

 * [[the seed]] - 에코위키의 [[위키 엔진]].
 * [[the seed forum]] - 위키 엔진인 the seed engine에 관하여 기술적 지원 문의를 받는 곳이다. [[https://forum.theseed.io/|바로가기]]
 * [[나무마크]] -  에코위키의 텍스트 문법.
 * [[에코위키:도움말|도움말]] - 에코위키에 처음 온 사용자들을 위한 도움말 문서다.
 * [[에코위키:FAQ|FAQ]] - 에코위키로부터 자주 들어오는 질문에 대한 답변을 하는 문서다.
 * [[에코위키:가이드]] - 에코위키의 주요 기능 및 단축키를 설명하는 문서.
 * [[문서#s-3]] - 에코위키에 존재하는 개별 페이지들을 문서라고 한다. [[:분류:에코위키의 규정|에코위키의 규정]]에 맞게 문서를 작성해야 하며, 나무마크를 통해 문서를 편집할 때 다양한 기능을 사용할 수 있다.
 * [[에코위키:가이드/이미지 업로드|이미지 업로드]] - 파일을 에코위키 서버에 올려서 문서에서 활용할 수 있게 해 주는 기능이다. [[:분류:파일]] 문서에서 에코위키에 업로드 된 파일 목록을 확인할 수 있다.[* 이전에는 [[imgur]] 등의 외부 사이트에 이미지를 올리고 에코위키에 핫링크를 했었지만 지금은 기능을 막아두었다. 자세한 이유는 [[imgur#s-2.1|여기]]를 참고.]
 * [[분류#s-1.1|분류]] - 에코위키 문서들을 각 주제에 맞게 분류할 수 있는 기능이다. 최상위 분류는 [[:분류:분류]] 문서.
 * [[틀#s-2|틀]] - 안내 기능을 하거나 비슷한 다른 문서들을 묶어주는 박스이다. [[에코위키:틀]] 문서나 [[:분류:틀]] 문서에서 에코위키의 틀 목록을 확인할 수 있다.
 * [[:분류:템플릿|템플릿]] - 동일한 주제의 여러 문서들에 일괄적으로 적용되는 문서를 만들 때 사용하는 양식이다. [[:분류:템플릿]] 문서에서 템플릿 목록을 확인할 수 있다.
 * [[에코위키:토론 도움말|토론]] - 문서 작성에 관해 의견 충돌이 벌어졌을 경우, 토론 합의를 통해 더 좋은 문서를 만들어가기 위한 기능이다.
 * [[에코위키:내 문서함|내 문서함(스타)]] - 주시 문서 기능으로, 로그인 후 내 문서함에서 스타를 체크한 문서 목록을 문서의 최근 편집일자 순으로 모아서 볼 수 있다.
 * [[에코위키:프로젝트]] - 에코위키 사용자들이 위키 기여를 더욱 알차게 하기 위해 자발적으로 개설하여 서로 협력하면서 문서 기여를 하는 프로젝트이다. 프로젝트 목록은 [[:분류:에코위키 프로젝트]] 문서에서 볼 수 있다.
 * [[에코위키:문서 작성 요청]] - 에코위키에 아직 없는 문서 중 필요하다고 느껴지는 문서들을 요청하는 집단연구 성격의 메타 문서이다.
 * [[에코위키:주요 페이지 링크]] - 리그베다 위키 시절의 흔적으로, 각 주제별로 문서를 모아놓는 [[메타 문서]] 목록의 일부를 나열한 문서이다. 메타 문서 목록은 [[:분류:메타 문서]]에서 확인할 수 있다.
 * [[에코위키:게시판|게시판]] - 에코위키의 공지사항이 올라오는 곳이며, 이곳에서 문의, 신고, 소명 등 여러가지 업무를 처리한다. 그루터기에서 사용자들이 에코위키와 관련된 글을 올릴 수 있다.
 * [[에코위키:통계|통계]] - 에코위키의 문서 개수를 확인할 수 있는 곳이다.
 * [[에코위키:연습장|연습장]] - 에코위키의 여러가지 위키 문법과 편집 기술들을 연습할 수 있는 곳이다.
 * [[에코위키:보존문서|보존문서]] - 기록 보존을 위해 보존된 운영 관련 문서들이다. [[:분류:보존문서]] 문서에서 보존문서의 목록을 확인할 수 있다.
 * [[사용자 문서]] - 각 계정 당 하나씩 가지게 되는 [[사용자]] 고유의 문서이다. 계정 사용자와 관리자만 편집이 가능하다.
 * [[스킨#s-4]] - 에코위키에 적용할 수 있는 스킨으로, 에코위키 기본 스킨인 senkawa와 로그인 후 설정할 수 있는 [[리브레 위키]] 스킨의 liberty가 있다. 두 스킨 모두 밝은 화면과 [[에코위키:어두운 화면|어두운 화면]]을 설정할 수 있다.
'
from category c where c.name = '에코위키' and c.namespace = '에코위키';

insert into document_commit (commit_index, previous_id, document_id, trunk)
select 1, null, d.id, 1 from document d inner join category c on d.category_id = c.id
where d.name = '에코위키' and c.namespace = '에코위키';

insert into document (category_id, name, content)
select c.id, '에코위키 도움말', '[[분류:일반 틀]][[분류:에코위키의 도움말]]
{{{#!wiki style="border: 1px solid gray; border-top: 5px solid #00a495;padding:12px;margin-bottom:0px;"
[[에코위키:편집지침|[[파일:YYgMAiA.png|width=70px&align=left]]]]{{{#!wiki style="margin-right:10px;margin-left:80px;"
{{{+1 이 문서는 에코위키의 도움말입니다.}}}[br]
이 문서는 에코위키 초보자를 위한 문서입니다. 규정으로서의 효력은 없습니다.}}}}}}'
from category c where c.name = '에코위키의 도움말' and c.namespace = '에코위키';

insert into document_commit (commit_index, previous_id, document_id, trunk)
select 1, null, d.id, 1 from document d inner join category c on d.category_id = c.id
where d.name = '에코위키 도움말' and c.namespace = '에코위키';

insert into document (category_id, name, content)
select c.id, '도움말', '[include(틀:에코위키)]
----
[include(틀:에코위키 도움말)]
{{{#!wiki style="border: 1px solid gray; border-top: 5px solid #00a495;padding:12px"
{{{+1 {{{#teal ''''''안내''''''}}}}}}[br]
 * 에코위키의 도움말들을 모아 놓은 문서입니다. 자세한 내용은 해당 도움말 문서에서 확인하셔야 합니다.
 * 목차에서 여러분께 필요한 내용을 찾아서 보시면 됩니다.}}}
[목차]
== 에코위키 ==
[[에코위키]]에 오신 여러분을 환영합니다. 이곳은 에코위키의 도움말입니다. 아래 내용을 읽어 보시고 에코위키에 대해 알아보시기 바랍니다.

 *에코위키는 [[위키]]입니다. 위키란 여러 사람들이 각자가 가진 정보를 문서 생성 및 편집을 통해 공유할 수 있도록 한 웹사이트를 말합니다.
 * [[에코위키]]는 [[리그베다 위키 사유화 사태]]로부터 탄생한 대체 위키 중 하나이며 그 어떤 위키에도 속하지 않습니다. 에코위키와 다른 위키 웹사이트와의 차이점을 알고 싶다면 [[에코위키:다른 위키와의 차이점]] 문서를 참고해 주세요.
 * 에코위키의 인터페이스 및 기초적인 사용법을 익히시려면 [[에코위키:가이드]]를 이용하세요.
 * 에코위키를 사용하다 오류가 발생하셨나요? 에코위키를 하다 궁금증이 생기셨나요? 자주 할만한 질문들이 [[에코위키:FAQ]]에 있습니다!
 * 에코위키의 문법을 익히시려면 [[에코위키:문법 도움말]]을 이용하세요.
 * 문서를 작성하기 전에, [[에코위키:편집 도움말]]도 참고해 보세요.
 * 이미지를 올려서 문서에 사용하고 싶다면 [[에코위키:가이드]]의 [[에코위키:가이드#s-5|해당]] 문단을 읽고 따라 해 보세요.
 * 위키 사용법이나 문법을 연습하고 싶다면 [[에코위키:연습장]]을 이용해 보세요.
 * 혹시라도 이 문서가 생성 되었으면 좋겠다! 라고 생각하시는데, 혼자서는 어려우신가요? [[에코위키:문서 작성 요청]]을 이용해 보세요! 같은 분야에 관심이 많은 이용자분들이 함께 기여해 줄겁니다.
 * 도움말만 전부 읽으셔도 에코위키 이용에 전혀 지장이 없습니다.'''''' 읽는 것을 권장합니다!''''''

== 규정 및 운영 ==
''''''자세한 내용은 [[에코위키:기본방침|기본방침]]을 참조하세요.''''''

=== 규정 ===
 * 에코위키에는 모든 이용자가 지켜야 하는 규정이 있습니다. 여러 사람들이 이용하는 공간이기 때문에 규칙이 있고, 에코위키에서는 이를 ''''''규정''''''이라고 부릅니다.
  * 규정은 크게 ''''''방침''''''과 ''''''지침''''''으로 나뉩니다. 방침은 ''''''운영/토론/이용자 관리''''''에 대한 규정을 담고 있고, 지침은 ''''''문서 편집''''''에 대한 규정을 담고 있습니다. 우리나라 법의 헌법에 대응하는 에코위키 최상위 규정은 ''''''[[에코위키:기본방침|기본 방침]]''''''이며 모든 규정은 기본 방침에 위배되어서는 안 됩니다.

=== 운영진 ===
 * 에코위키는 파라과이 소재의 법인 ''''''[[umanle S.R.L.]]''''''이 운영하고 있습니다. 이들은 ''''''사측(社側)''''''으로도 불립니다. 에코위키는 ''''''사측''''''과 사측에 의하여 선출되는 선출직 운영자들의 도움으로 운영되고 있습니다.
 * ''''''[[umanle S.R.L.]]'''''', 즉 사측에 소속된 직원들을 ''''''사측 관리자''''''라고 부릅니다. 현재 에코위키를 운영하는 사측 관리자 계정은 두 종류로, ''''''[[사용자:관리자|관리자]]''''''와 ''''''[[사용자:umanle|umanle]]''''''라는 계정명을 사용하고 있습니다.[* 이들의 계정명과 매우 유사하거나, 사측 관리자로 오인할수 있을만한 다른 계정명을 사용하는 이용자를 발견하신 경우 즉시 [[https://board.namu.wiki/report|신고게시판]]을 통하여 신고하여 주시기 바랍니다. 이는 부적절한 계정명에 해당합니다.]
 * 에코위키는 매우 규모가 큰 위키 사이트기 때문에 사측의 인력 만으로는 모든 업무를 처리하지 못합니다. 그래서 사측은 일반 이용자들 중에서 지원을 받아 운영자를 선출하여 운영에 도움을 받습니다. 이 운영자들을 ''''''선출직 운영자''''''라고 부릅니다.
  * 선출직 운영자에는 ''''''[[에코위키:관리자|관리자]]''''''와 ''''''[[에코위키:중재자|중재자]]''''''가 있습니다. 관리자는 에코위키의 업무 전반을 처리하는 운영자를 말하고, 중재자는 토론의 중재와 관련한 업무를 처리하는 운영자를 말합니다.
  * 회원가입한 이용자들은 누구나 운영자에 지원할 수 있습니다. 다만 최근에 가입했거나, 관리자의 경우 기여내역이 300회 이내, 중재자의 경우 토론 기여내역이 낮은 사용자는 선출되지 못할 가능성이 매우 높습니다. 지원을 희망하는 사용자는 [[https://namu.wiki/discuss/%EB%82%98%EB%AC%B4%EC%9C%84%ED%82%A4%3A%EC%9A%B4%EC%98%81%EC%A7%84%20%EC%A7%80%EC%9B%90|이곳]]에서 지원하실 수 있습니다.

== 토론 ==
자세한 내용은 ''''''[[에코위키:토론 도움말|토론 도움말]]''''''과 ''''''[[에코위키:기본방침/토론 관리 방침|토론 관리 방침]]''''''을 참조하세요.
 * 문서를 편집하다 보면 분쟁이 생길 수 있습니다. 에코위키에서는 이런 경우 토론으로 해결해야 합니다. 토론하기 전에 토론에 대한 기본예절과 절차는 [[에코위키:토론 도움말]]을 참조하세요.
 * 토론에서도 위키 문법이 적용됩니다. (단, 일부 문법은 적용되지 않습니다) 토론에서의 위키 문법을 연습하시려면 [[에코위키:연습장]]의 [[https://namu.wiki/discuss/%EB%82%98%EB%AC%B4%EC%9C%84%ED%82%A4:%EC%97%B0%EC%8A%B5%EC%9E%A5|토론]]에 연습용 토론이 열려 있으니 그곳을 이용해 주세요.
 * 간단한 가이드:[[에코위키:토론 도움말]]이 읽기 버거우시다면 이것이라도 읽고 토론에 임하세요.
  * 상대의 발언에 감정적으로 대응하지 마세요! 에코위키에서 토론으로 차단당하는 대부분은 감정적인 대응 때문인 경우가 많습니다.
  * 상대가 근거를 제시하라고 요구하면 제시해야 합니다! 근거 없는 주장을 반복하면 차단의 사유가 됩니다.
  * 편집 분쟁 중이라고 상대의 아이디를 토론 제목에 언급해서는 안 됩니다! 차단의 사유가 됩니다. 호출은 사용자 토론을 이용하세요.
  * 충분히 근거를 제시하였음에도, 토론이 원활하게 진행이 안될 때, [[https://board.namu.wiki/discuss|토론 문의 게시판]]에서 중재 요청을 하시면 담당 중재자께서 도움을 주실겁니다.


== 단축키 ==
 * {{{+1 F}}}(''''''F''''''ront Gate): [[에코위키:대문|대문]]
 * {{{+1 C}}}(Recent''''''C''''''hanges): [[https://namu.wiki/RecentChanges|최근 변경]]
 * {{{+1 D}}}(Recent''''''D''''''iscuss): [[https://namu.wiki/RecentDiscuss|최근 토론]]
 * {{{+1 A}}}(R''''''A''''''ndom): [[https://namu.wiki/random|랜덤 문서]]
 * {{{+1 Shift + S}}}(''''''S''''''earch): 검색
 * {{{+1 E}}}(''''''E''''''dit): 문서 편집
 * {{{+1 ?}}}[* Shift + /]: 단축키 도움말 (연속으로 계속누르면 화면이 까매진다)
참고로 ?를 제외한 모든 단축키는 [[Caps Lock]]이 꺼진 상태에서만 유효하다. 반대로 켜져 있을 때에는 S만 눌러도 검색창이 뜬다.

== 스킨 설정 ==
 * 취소선이 보기 싫으신가요? 화면 우측에 올라오는 [[나무라이브]] 글들이 보기 싫으신가요? 스킨 설정으로 숨기실 수 있습니다! [[에코위키:스킨 설정 도움말]]에서 이 기능의 사용법 및 다른 다양한 설정 기능들을 익혀 보세요.

== 게시판 이용 ==
 * 각 게시판의 용도가 궁금하신가요? 게시판을 어떻게 이용해야 할지 궁금하신가요? [[에코위키:게시판 이용 도움말]]을 참고해 보세요.

== 차단 소명과 이의 제기 ==
 * 자신의 차단이 억울하신가요? 아니면 선처를 원하시나요? 아니면 운영자의 업무 처리가 불만인가요? [[에코위키:소명 도움말]]을 읽으시고 도움을 받아 보세요.

== 임시조치 요구 ==
 * 명예훼손 등으로 임시조치(게시 중단 요청)를 원하시는 분께서는 [[에코위키:권리침해 도움말]]을 읽어 보세요.

== 자주 하는 실수 ==
=== [[에코위키:문서 삭제식 이동|문서 삭제식 이동]] ===
문서 제목을 변경하기 위해 문서를 삭제하고 다른 문서로 내용을 복사 - 붙여넣기 하는 것을 말합니다. 이렇게 할 경우 이 문서의 원래 기여자가 누구였는지 알 수 없게 되고, 다른 사람들이 보기에는 마치 이동한 사용자의 단독 기여로 만들어진 문서처럼 보이게 됩니다. 그렇기 때문에 이런 행동은 저작권 침해 행위로 간주될 수 있습니다. 자세한 내용은 [[에코위키:문서 삭제식 이동|문서 삭제식 이동]]을 참조하세요.

문서의 제목을 변경하시려면 편집 탭에 들어가서 이동을 누르시고 변경할 제목을 입력해주세요. 권한이 없다면 문의 게시판에 이동을 요청하시면 됩니다.

==== 문서·문단 분리·병합 실수 ====
문서나 문단을 다른 문서로 옮길 때에는 문서 삭제식 이동을 할 수밖에 없으므로, [[에코위키]]의 [[라이선스]]인 CC BY-NC-SA 2.0 KR 중 BY를 위반하지 않기 위해, 원래 내용을 가져온 문서를 표시해야 합니다. [[틀:문서 가져옴]], [[틀:문단 가져옴]], [[틀:문서 가져옴/문단]], [[틀:문단 가져옴/문단]]을 사용해서 표시할 수 있으니 경우에 따라 알맞은 것으로 골라서 사용해주세요. 또한 해당 틀을 사용할 경우, [[틀:문서 가져옴]]이나 [[틀:문서 가져옴/문단]]의 경우 문서 최하단에 위치해야 합니다. {{{[include(틀:문서 가져옴, title=이전 문서명, version=버전)]}}} 을 작성한 뒤에, 바로 윗 줄에 {{{[각주]}}} 를 사용해서 각주를 소환해 주세요. 또한 문단을 분리할 때 위와 같은 문법을 사용하지 않으면 경고를 받거나 임시로 차단될 수 있습니다.

=== [[수정 코멘트]] 및 [[토론]]에서의 말실수 ===
[[에코위키:기본방침/이용자 관리 방침]]에 따라 비하적, 모욕적 표현을 사용하는 등 잘못된 수정 코멘트를 적는 경우는 편집 요약 불량에 해당합니다. 수정 코멘트는 가급적 편집의 목적이나 내용을 요약하는 용도로 사용해주세요. 또한 토론에서 비하, 모욕적 표현 및 반말을 사용하시는 것은 이용자 관리 방침에서 정하는 [[에코위키:기본방침/이용자 관리 방침#s-4|토론 관련 규정]] 위반입니다. 주의해주세요.

=== 요청형, 질문형, 통보형 토론 발제 ===
에코위키의 토론은 문서의 편집 방향에 이견이 발생했을 때 이를 조율하고 편집 방향을 합의하는 목적으로만 활용되고 있습니다. 즉 [[토의]]가 아닌 [[토론]]만 가능합니다. 단순히 편집 요청을 하시려면 [[편집 요청]] 기능을 이용해주십시오. 더불어, 본문 편집과 무관하게 단순히 궁금증이 생겨서 질문하거나, 혹은 자신의 편집 사실을 알리기 위한 통보를 하는 것 역시 적절한 토론 개설방법이 아닙니다. 자세한 내용은 [[에코위키:토론 도움말]] 또는 [[토론 관리 방침]]을 참조하십시오.[* 후자는 에코위키 공식 규정이고, 전자는 공식 규정을 초보자를 위해 쉽게 풀어쓴 설명입니다. 초보라면 전자를 우선 읽는 것을 추천합니다.]
다만 프로젝트 문서의 토론에서는 프로젝트가 관할하는 문서들에 대한 질문성 또는 요청성 토론의 발제가 가능합니다. 서로의 의견을 나누고 협업하여 문서를 기여해 보세요!
=== 차단 소명 관련 실수 ===
 * 차단을 당하신 후 소명을 하실 때 이용자께서 당황하신 나머지 차단당한 아이피나 아이디를 아예 적지 않으시는 경우도 있습니다. 꼭 아이피나 아이디를 적어주셔야 소명 처리를 해드릴 수 있습니다.
 * 차단을 당하셨을 때에는 차단 소명 게시판만 이용할 수 있습니다. 실수로 문의 게시판에 쓰셨을 때 차단 회피로 처리되지 않습니다. 운영자에게 차단 소명 게시판으로 안내를 받으실 수 있지만 웬만하면 차단 소명 게시판을 바로 이용해주시기 바랍니다. 문의 게시판에서는차단 소명 게시판에서의 글 작성이 불가능하다거나 하는 경우를 제외하면 차단 소명 처리를 하지 않기 때문입니다. 또한 문의 게시판과 차단 소명 게시판 외 다른 게시판에 글을 작성하시면 차단 회피 처리를 받으니 주의해주세요.
 * 차단된 상태에서 부계정이나 다른 아이피로 접속해서 문서 편집이나 토론을 계속할 경우 [[차단 회피]]로 징계기간이 길게 연장될 수 있습니다.
 * 차단 소명 글을 작성하실 때는 절대 타 이용자를 제재해달라는 글을 작성하시면 안됩니다. 이 경우 소명글은 즉시 각하되며, 경우에 따라 차단 기간이 연장 될 수도 있습니다. 타 이용자 제재 요청은 차단 해제 이후에 신고 게시판에서 해주세요.

=== 서술 시점 고정 ===
토론을 열 경우, 서술 시점을 제대로 고정하셔야 합니다. 서술 시점을 제대로 고정하지 않으실 경우, 편집권 남용으로 제재받으실 수도 있습니다. 자세한 사항은 [[에코위키:기본방침/토론 관리 방침#s-2.2|토론 관리 방침 2.2항]]이나, [[에코위키:토론 도움말#s-4.1.1|토론 도움말 4.1.1항]]에 나와 있습니다.

[각주]
[include(틀:문서 가져옴, title=에코위키:자주 하는 실수, version=85)]
[[분류:에코위키의 도움말]]'
from category c where c.name = '도움말' and namespace = '에코위키';

insert into document_commit (commit_index, previous_id, document_id, trunk)
select 1, null, d.id, 1 from document d inner join category c on d.category_id = c.id
where d.name = '도움말' and c.namespace = '에코위키';
